[
  {
    "id": "WIL-155002",
    "companyName": "Wildlife Studios",
    "companyLogo": "/images/companies/wildlifestudios.svg",
    "jobTitle": "Senior 2D Game Artist",
    "description": "**Senior 2D Game Artist**\nWildlife Studios\n\n**Sobre a Vaga**\n\nJunte-se à equipe de Arte da Wildlife Studios! Nossos jogos alcançam milhões de jogadores, oferecendo personagens inesquecíveis, mundos vibrantes e experiências emocionantes. Buscamos artistas versáteis, curiosos e apaixonados, que trabalhem em sinergia com designers, engenheiros e PMs para criar jogos mobile icônicos. Valorizamos a inovação e a autonomia criativa, e estamos sempre evoluindo nossos processos, explorando ferramentas como Gen-AI para iterações mais rápidas e inspiradas.\n\nNossos 2D Game Artists são criadores adaptáveis que contribuem em diversas áreas da arte para dar vida aos jogos. Você trabalhará em estreita colaboração com equipes multidisciplinares para transformar ideias em experiências visuais atraentes, desde protótipos iniciais até assets de produção refinados.\n\n**Responsabilidades**\n\n*   Liderar a visão artística dentro de pequenas equipes de desenvolvimento de jogos, definindo o papel da arte no jogo.\n*   Colaborar com diretores de arte e outros artistas para garantir a consistência e qualidade visual.\n*   Criar arte 2D de alta qualidade, com potencial para contribuir em outras áreas como UI, 3D e animação (artista \"T-shaped\").\n*   Contribuir para o design do jogo, buscando a melhor experiência para o jogador.\n*   Colaborar com áreas como Marketing para definir a temática visual do jogo, utilizando dados reais dos jogadores.\n*   Ajudar a transformar Game Design Documents (GDDs) em jogos mobile jogáveis e definir pipelines para as próximas fases de desenvolvimento.\n*   Solucionar problemas relacionados à arte e ao desenvolvimento do jogo.\n*   Explorar e integrar ferramentas de Gen-AI para otimizar o fluxo de trabalho e gerar novas ideias.\n\n**Requisitos**\n\n*   Paixão por criar jogos e compreensão de como os visuais influenciam o gameplay, UX e o engajamento do jogador.\n*   Habilidade em usar imagens para evocar emoção, sugerir lore e comunicar a direção do estilo visual.\n*   Sólidos fundamentos de arte 2D (composição, cor, anatomia, iluminação).\n*   Experiência com ferramentas de Gen-AI para sketch de ideias, refinamento de direção e criação de referências.\n*   Conhecimento de como controlar a qualidade de modelos de Gen-AI, criar prompts customizados, usar workflows de inpainting e combinar resultados de Gen-AI com técnicas tradicionais (paintover, photobash, etc.).\n*   Habilidade de trabalhar em equipe, buscando feedback e compartilhando conhecimento.\n*   Capacidade de interagir com pessoas de diferentes backgrounds e especialidades.\n*   Inglês fluente (comunicação diária com equipes internacionais).\n\n**Benefícios**\n\n*   (A empresa deverá preencher com informações relevantes sobre os benefícios oferecidos. Ex: Salário competitivo, plano de saúde, vale refeição, etc.)\n\n*Wildlife Studios is committed to creating a diverse and inclusive environment.*",
    "applyLink": "https://job-boards.greenhouse.io/wildlifestudios/jobs/8290155002",
    "postedDate": "2025-11-13T00:00:00.000Z",
    "category": "Animation",
    "tags": [
      "3D",
      "Design",
      "Go",
      "Animation",
      "Mobile",
      "AI",
      "2D",
      "Unity",
      "Artist",
      "TypeScript"
    ],
    "location": {
      "scope": "hybrid"
    },
    "companyWebsite": "https://wildlifestudios.com/",
    "shortDescription": "**Senior 2D Game Artist**\nWildlife Studios\n\n**Sobre a Vaga**\n\nJunte-se à equipe de Arte da Wildlife Studios! Nossos jogos alcançam milhões de jogadores, oferecendo personagens inesquecíveis, mundos vibrantes e experiências emocionantes. Buscamos artistas versáteis, curiosos e apaixonados, que tra..."
  },
  {
    "id": "WIL-008002",
    "companyName": "Wildlife Studios",
    "companyLogo": "/images/companies/wildlifestudios.svg",
    "jobTitle": "Senior Creative Producer - Marketing",
    "description": "**Senior Creative Producer - Marketing**\n**Wildlife Studios**\n\n**Sobre a Vaga:**\n\nVocê está pronto para moldar o futuro criativo do mobile gaming em larga escala? Estamos buscando um(a) Senior Creative Producer para integrar nossa equipe de Creative Strategy — alguém apaixonado por grandes ideias, resultados mensuráveis e inteligência de mercado. Este papel será fundamental para impulsionar a visão criativa por trás de nossas campanhas de performance marketing, garantindo que cada decisão seja baseada em dados, insights e um profundo conhecimento da indústria de jogos mobile.\n\nComo Senior Creative Producer na Wildlife, você liderará o desenvolvimento criativo desde o planejamento estratégico até a execução — guiando a produção de vídeos, playable ads e static ads usados em campanhas de User Acquisition. Você será co-responsável pela estratégia criativa entre diferentes títulos, colaborando estreitamente com Product Marketing Managers (PMMs) e nossa equipe de produção interna para: i) identificar os principais conceitos de anúncios; ii) definir o que devemos produzir; iii) como vamos produzir e iv) avaliar os resultados. Você trabalhará na interseção de criatividade, dados, análise de mercado e produção — com total responsabilidade sobre o processo de ponta a ponta. O(A) candidato(a) ideal traz uma forte visão criativa, uma mentalidade de performance marketing e uma curiosidade natural por tendências, jogadores, concorrentes e inovações.\n\n**Responsabilidades:**\n\n*   Co-gerenciar e impulsionar a estratégia criativa em vários jogos em colaboração com PMMs.\n*   Escrever briefs criativos claros e acionáveis que conectem insights estratégicos à execução.\n*   Liderar o desenvolvimento de ponta a ponta de ativos criativos de alto desempenho (vídeo, playable, static) para campanhas de performance marketing.\n*   Analisar os resultados de desempenho criativo e iterar com base em métricas-chave (Spend Share, IPM, CTR, CPI, ROAS).\n*   Realizar benchmarking contínuo das tendências criativas dos setores de jogos e anúncios mobile — traduzindo insights em campanhas inovadoras e eficazes.\n*   Manter-se atualizado sobre as tendências do mercado e do gênero, o comportamento do jogador e as estratégias criativas competitivas.\n*   Usar ou colaborar com ferramentas de creative intelligence para orientar o planejamento e a ideação.\n*   Fazer parceria com PMMs e Data Scientists para definir metodologias de teste e descobrir insights acionáveis.\n*   Atuar como um ponto central de alinhamento para prioridades criativas entre Marketing e Produção.\n*   Elevar o nível criativo enquanto escala a produção, ajudando a equipe a atingir as metas de volume, qualidade e desempenho.\n*   Apoiar a melhoria contínua das operações criativas por meio de estrutura, processo e liderança.\n\n**Requisitos:**\n\n*   Sólido histórico em performance marketing, com profundo envolvimento na estratégia criativa e execução de campanhas de User Acquisition.\n*   Forte compreensão de KPIs criativos e métricas de desempenho — e como aplicá-los à iteração e tomada de decisão.\n*   Experiência na condução de creative benchmarking e extração de insights do mercado.\n\n**Diferenciais:**\n\n*   Familiaridade com a indústria de jogos mobile ou experiência em creatives de performance para jogos ou aplicativos.\n*   Familiaridade com motion design e/ou desenvolvimento de playable ads.\n*   Familiaridade com ferramentas de market intelligence (e.g., Sensor Tower, etc.).\n\n**Benefícios:**\n\n*   [A empresa deve incluir uma lista dos benefícios oferecidos aqui. Exemplo: Plano de saúde, plano odontológico, vale-refeição, etc.]\n\n*Wildlife Studios é uma empregadora que oferece oportunidades iguais a todos.*",
    "applyLink": "https://job-boards.greenhouse.io/wildlifestudios/jobs/8289008002",
    "postedDate": "2025-11-13T00:00:00.000Z",
    "category": "Game Dev",
    "tags": [
      "Design",
      "Go",
      "Git",
      "Game Dev",
      "Mobile",
      "Senior",
      "AI",
      "Unity",
      "TypeScript"
    ],
    "location": {
      "scope": "hybrid"
    },
    "companyWebsite": "https://wildlifestudios.com/",
    "shortDescription": "**Senior Creative Producer - Marketing**\n**Wildlife Studios**\n\n**Sobre a Vaga:**\n\nVocê está pronto para moldar o futuro criativo do mobile gaming em larga escala? Estamos buscando um(a) Senior Creative Producer para integrar nossa equipe de Creative Strategy — alguém apaixonado por grandes ideias..."
  },
  {
    "id": "WIL-998002",
    "companyName": "Wildlife Studios",
    "companyLogo": "/images/companies/wildlifestudios.svg",
    "jobTitle": "3D Game Artist",
    "description": "**Título da Vaga:** Artista de Jogos 3D\n\n**Empresa:** Wildlife Studios\n\n**Sobre a Vaga:**\n\nO time de Arte da New Games está crescendo! Nossos jogos alcançam milhões de jogadores, oferecendo personagens inesquecíveis, mundos vibrantes e experiências emocionantes. Essa é uma grande missão, e nosso segredo são as pessoas. Somos um coletivo de artistas versáteis, curiosos e apaixonados, trabalhando em sinergia com designers, engenheiros e PMs para criar jogos mobile icônicos. Valorizamos a inovação e a autonomia criativa, e estamos sempre evoluindo nossos processos, explorando ferramentas emergentes como Gen-AI para iterações mais rápidas e inspiradas.\n\nComo Artista de Jogos 3D Sênior, você será um criador adaptável, contribuindo em diversas áreas da arte para dar vida a jogos 3D. Você trabalhará em estreita colaboração com equipes multidisciplinares para transformar ideias em experiências visuais atraentes, desde protótipos iniciais até assets de produção refinados.\n\n**Responsabilidades:**\n\n*   Colaborar com diversas equipes, com diferentes membros, objetivos e problemas a serem resolvidos.\n*   Comunicar-se com uma ampla gama de stakeholders, desde desenvolvedores de jogos juniores e game designers até a liderança sênior.\n*   Transformar Game Design Documents (GDDs) em jogos mobile jogáveis, ajudando a definir os pipelines para as próximas fases de desenvolvimento.\n*   Identificar e solucionar problemas e obstáculos de forma eficiente.\n*   Iterar rapidamente para encontrar as melhores soluções para o gameplay e a experiência geral do jogador.\n*   Ajudar a definir como e quando usar Gen-AI, quais ferramentas adotar e como garantir a qualidade e a consistência do output.\n*   Construir e evoluir workflows.\n\n**Requisitos:**\n\n*   Paixão por criar jogos e entender como os visuais influenciam o gameplay, a UX e o engajamento do jogador.\n*   Conforto em transitar entre disciplinas 2D e 3D (concepting, modelagem, texturização, iluminação ou animação, conforme necessário).\n*   Sólido conhecimento na criação de assets otimizados para jogos, sem sacrificar o apelo visual.\n*   Experiência com Unity e/ou outras game engines, e Git, desde a estrutura de pastas até a implementação de um jogo totalmente jogável.\n*   Habilidade em utilizar e aprimorar ferramentas de Gen-AI, controlando a consistência do modelo, criando prompts personalizados, utilizando workflows de inpainting e combinando resultados de Gen-AI com técnicas tradicionais (paintover, photobash, etc.).\n*   Ser um jogador de equipe automotivado que busca feedback proativamente e compartilha conhecimento.\n*   Boa interação com pessoas de diversas origens e especialidades.\n*   Experiência na criação de múltiplos jogos, como indie e/ou dentro de um estúdio de jogos.\n*   Portfólio online demonstrando habilidades relevantes.\n\n**Benefícios:**\n\nA Wildlife Studios oferece um ambiente de trabalho dinâmico e desafiador, com oportunidades de crescimento e desenvolvimento profissional. Detalhes sobre os benefícios serão fornecidos durante o processo seletivo.\n\n*A Wildlife Studios valoriza a diversidade e a inclusão em todas as suas práticas.*",
    "applyLink": "https://job-boards.greenhouse.io/wildlifestudios/jobs/8282998002",
    "postedDate": "2025-11-10T00:00:00.000Z",
    "category": "3D",
    "tags": [
      "3D",
      "Design",
      "Go",
      "Git",
      "Animation",
      "AI",
      "2D",
      "Unity",
      "Artist",
      "TypeScript"
    ],
    "location": {
      "scope": "hybrid"
    },
    "companyWebsite": "https://wildlifestudios.com/",
    "shortDescription": "**Título da Vaga:** Artista de Jogos 3D\n\n**Empresa:** Wildlife Studios\n\n**Sobre a Vaga:**\n\nO time de Arte da New Games está crescendo! Nossos jogos alcançam milhões de jogadores, oferecendo personagens inesquecíveis, mundos vibrantes e experiências emocionantes. Essa é uma grande missão, e nosso ..."
  },
  {
    "id": "WIL-904002",
    "companyName": "Wildlife Studios",
    "companyLogo": "/images/companies/wildlifestudios.svg",
    "jobTitle": "Manager, Site Reliability Engineer",
    "description": "**Manager, Site Reliability Engineer**\nWildlife Studios\n\n**Sobre a Vaga:**\n\nEstamos buscando um(a) Site Reliability Engineer Manager talentoso(a) e apaixonado(a) para se juntar à equipe de Cloud Platform da Wildlife. Como SRE Manager, você terá como objetivo fornecer sistemas de fácil utilização e alta disponibilidade para todos os(as) engenheiros(as) da empresa. Seu principal foco será capacitar sua equipe a aprimorar os serviços de infraestrutura, utilizando e refinando nossas automações existentes, ao mesmo tempo em que contribui em decisões técnicas e de negócios para novos serviços que suportarão a escalabilidade e usabilidade dos serviços de infraestrutura na empresa. Também será responsável por melhorar o crescimento profissional, o engajamento e a retenção da equipe.\n\n**Responsabilidades:**\n\n*   Gerenciar uma equipe multifuncional, contribuindo para o roadmap da equipe e o crescimento de seus(suas) colaboradores(as) individuais.\n*   Desenvolver, manter e otimizar clusters de infraestrutura (e.g., Kubernetes, NATS, ETCD, Postgres, MongoDB, Redis, Elasticsearch), serviços de infraestrutura (e.g., Gitlab, Jenkins, Vault, Artifactory, Datadog, Jaeger, etc.) e nossas APIs e automações para gerenciá-los (e.g., Kubernetes Operators, Infrastructure as Code, Pipelines, CLIs).\n*   Analisar os custos dos serviços de infraestrutura e ajudar a definir e otimizar o orçamento de nossa infraestrutura e equipes de jogos.\n*   Contribuir para melhorias nos padrões de monitoramento e observabilidade para serviços de infraestrutura.\n*   Solucionar problemas, gerenciar e liderar incidentes em produção.\n*   Gerenciar e melhorar as ferramentas e processos relacionados ao gerenciamento de infraestrutura em toda a empresa (padrões de Infrastructure-as-Code, design de CI/CD, construção de nossa Internal Developer Platform, etc.).\n*   Ajudar as equipes parceiras a arquitetar e escalar suas aplicações e infraestrutura com as melhores práticas nativas da nuvem (cloud-native).\n\n**Requisitos:**\n\nEsperamos que nossos(as) Managers sejam técnicos(as), dedicando cerca de 50% de seu tempo trabalhando junto com os(as) ICs (Individual Contributors) em seu trabalho diário e sendo uma voz ativa e participativa no roadmap técnico da equipe.\n\n*   Experiência gerenciando pequenas equipes com experiência em infraestrutura.\n*   Habilidades de liderança, incluindo gerenciamento de pessoas, comunicação, gerenciamento de projetos, desenvolvimento de talentos, gestão de desempenho, eficácia da equipe, agilidade, contratação, tomada de decisões, planejamento, orçamento e colaboração.\n*   Experiência em programação em pelo menos uma linguagem. Trabalhamos principalmente com Go e Python.\n*   Graduação em cursos relacionados a computação, como Engenharia da Computação, Ciência da Computação, Sistemas de Informação e Análise e Desenvolvimento de Sistemas ou experiência de mercado equivalente.\n*   Sólido entendimento de conceitos de computação (sistemas operacionais, redes, concorrência, gerenciamento de memória e análise de algoritmos).\n*   Experiência com serviços de computação em nuvem, como Amazon AWS, Google Cloud ou Microsoft Azure.\n*   Experiência com automação de Infrastructure as Code.\n\n**Benefícios:**\n\n[A empresa deverá inserir aqui os benefícios oferecidos.]\n\n*Wildlife Studios é um empregador de oportunidades iguais. Valorizamos a diversidade e estamos comprometidos em criar um ambiente inclusivo para todos os(as) funcionários(as).*",
    "applyLink": "https://job-boards.greenhouse.io/wildlifestudios/jobs/8226904002",
    "postedDate": "2025-10-24T00:00:00.000Z",
    "category": "Game Dev",
    "tags": [
      "Design",
      "Go",
      "Git",
      "Python",
      "AI",
      "CI/CD",
      "AWS",
      "Unity",
      "Kubernetes",
      "TypeScript"
    ],
    "location": {
      "scope": "remote-worldwide"
    },
    "companyWebsite": "https://wildlifestudios.com/",
    "shortDescription": "**Manager, Site Reliability Engineer**\nWildlife Studios\n\n**Sobre a Vaga:**\n\nEstamos buscando um(a) Site Reliability Engineer Manager talentoso(a) e apaixonado(a) para se juntar à equipe de Cloud Platform da Wildlife. Como SRE Manager, você terá como objetivo fornecer sistemas de fácil utilização ..."
  },
  {
    "id": "WIL-896002",
    "companyName": "Wildlife Studios",
    "companyLogo": "/images/companies/wildlifestudios.svg",
    "jobTitle": "Manager, Software Engineer",
    "description": "**Manager, Software Engineer**\n**Wildlife Studios**\n\n**Sobre a Vaga**\n\nEstamos buscando um(a) Manager de Software Engineer talentoso(a) e apaixonado(a) para se juntar à equipe de Engenharia da Wildlife. Na Wildlife, o trabalho que fazemos tem um grande impacto no sucesso e na cultura da empresa. Se você é uma pessoa curiosa, que toma a iniciativa, adora resolver problemas e prospera em um ambiente de negócios dinâmico e em crescimento, esta vaga é para você!\n\nA equipe de Plataforma da Wildlife está se reinventando. Inicialmente focada em fornecer serviços para os recursos online dos jogos, evoluiu para oferecer uma plataforma que potencializa o melhor de nossas equipes na criação, operação e distribuição de nossos jogos. Trabalhamos com um amplo stack tecnológico e temos uma abordagem de total responsabilidade por nossos sistemas, desde a concepção até a resolução de incidentes e solução de problemas em produção. Somos responsáveis por diversos serviços que, combinados, atendem a mais de 1 milhão de requisições por minuto. Este número está em constante crescimento e buscamos um(a) Manager que possa nos ajudar com os desafios de desenvolver sistemas com alto desempenho em larga escala.\n\n**Responsabilidades**\n\n*   Participar do design da arquitetura de sistemas, com foco no cliente, sejam eles jogadores ou outros funcionários da Wildlife.\n*   Supervisionar duas equipes de engenharia, responsáveis por entregar recursos críticos para todos os jogos da empresa.\n*   Supervisionar o design, desenvolvimento e manutenção de componentes e ferramentas de infraestrutura escaláveis, garantindo desempenho, confiabilidade e eficiência de custos.\n*   Colaborar estreitamente com líderes de engenharia, produto e design para alinhar prioridades, equilibrar trade-offs e remover obstáculos.\n*   Colaborar com diversas equipes e disciplinas para acelerar o desenvolvimento de jogos, otimizar operações e descobrir novas vias para expansão de recursos e geração de valor.\n\n**Requisitos**\n\n*   Bacharelado em Ciência da Computação ou áreas técnicas equivalentes e/ou experiência equivalente.\n*   Sólida experiência em desenvolvimento de software e design de soluções.\n*   Sólido entendimento de conceitos de computação (estruturas de dados, networking, concorrência, gerenciamento de memória e análise de algoritmos).\n*   Habilidade comprovada para gerenciar equipes de engenharia, desenvolver estimativas de orçamento de infraestrutura e traduzir estratégias da empresa em projetos tangíveis e acionáveis.\n\n**Diferenciais (Nice to have)**\n\n*   Experiência no desenvolvimento e manutenção de sistemas com um alto volume de requisições.\n*   Experiência no desenvolvimento de sistemas na indústria de jogos.\n*   Experiência no desenvolvimento de produtos de plataforma.\n*   Conhecimento de negócios sobre a indústria de jogos.\n*   Experiência em Golang.\n*   Experiência em network sockets.\n*   Experiência em desenvolvimento Unity.\n\n**Benefícios**\n\n[A empresa incluirá aqui a lista de benefícios oferecidos.]\n\n*Wildlife Studios is an equal opportunity employer.*",
    "applyLink": "https://job-boards.greenhouse.io/wildlifestudios/jobs/8226896002",
    "postedDate": "2025-10-24T00:00:00.000Z",
    "category": "Game Dev",
    "tags": [
      "Design",
      "Go",
      "Game Dev",
      "Mobile",
      "AI",
      "Unity",
      "Engine",
      "TypeScript"
    ],
    "location": {
      "scope": "onsite"
    },
    "companyWebsite": "https://wildlifestudios.com/",
    "shortDescription": "**Manager, Software Engineer**\n**Wildlife Studios**\n\n**Sobre a Vaga**\n\nEstamos buscando um(a) Manager de Software Engineer talentoso(a) e apaixonado(a) para se juntar à equipe de Engenharia da Wildlife. Na Wildlife, o trabalho que fazemos tem um grande impacto no sucesso e na cultura da empresa. ..."
  },
  {
    "id": "WIL-951002",
    "companyName": "Wildlife Studios",
    "companyLogo": "/images/companies/wildlifestudios.svg",
    "jobTitle": "Senior Site Reliability Engineer",
    "description": "**Senior Site Reliability Engineer**\n**Wildlife Studios**\n\n**Sobre a Vaga:**\n\nEstamos buscando um(a) Site Reliability Engineer (SRE) talentoso(a) e apaixonado(a) para se juntar à equipe de Cloud Platform da Wildlife. Como SRE, seu objetivo será fornecer sistemas fáceis de usar e altamente disponíveis para todos os engenheiros da empresa. Dentro da equipe de Cloud Platform, seu foco principal será aprimorar os serviços de infraestrutura, aproveitando e refinando as automações existentes, enquanto contribui para o desenvolvimento de novos serviços que aumentem a escalabilidade e a usabilidade. Acreditamos que o trabalho que fazemos tem um grande impacto no sucesso e na cultura da Wildlife. Se você é curioso(a), proativo(a), apaixonado(a) por resolução de problemas e prospera em um ambiente dinâmico e em crescimento, esta vaga é para você.\n\n**Responsabilidades:**\n\n*   Fazer parte de uma equipe multifuncional, contribuindo diretamente para o desenvolvimento de recursos e manutenção de serviços de infraestrutura novos e existentes.\n*   Desenvolver, manter e otimizar clusters de infraestrutura (Kubernetes, NATS, ETCD, Postgres, MongoDB, Redis, Elasticsearch, etc.) e serviços de infraestrutura (Gitlab, Jenkins, Vault, Artifactory, Datadog, Jaeger, etc.).\n*   Gerenciar a infraestrutura necessária para executar pipelines de build em nós Linux e macOS em nosso ambiente de nuvem.\n*   Definir padrões de monitoramento e observabilidade para serviços de infraestrutura.\n*   Solucionar problemas e gerenciar incidentes em produção.\n*   Gerenciar e aprimorar as ferramentas e processos relacionados ao gerenciamento de infraestrutura em toda a empresa (padrões de Infrastructure-as-code, design de CI/CD, construção de nossa Internal Developer Platform, etc.).\n*   Ajudar as equipes parceiras a arquitetar e escalar seus aplicativos e infraestrutura com as melhores práticas de Cloud.\n\n**Requisitos:**\n\n*   Sólida experiência em programação em pelo menos uma linguagem. Trabalhamos principalmente com Go e Python.\n*   Graduação em cursos relacionados à computação, como Engenharia da Computação, Ciência da Computação, Sistemas de Informação e Análise e Desenvolvimento de Sistemas ou experiência de mercado equivalente.\n*   Sólido entendimento de conceitos de computação (sistemas operacionais, redes, concorrência, gerenciamento de memória e análise de algoritmos).\n*   Experiência com serviços de cloud computing, como Amazon AWS, Google Cloud ou Microsoft Azure.\n*   Experiência com automações de Infrastructure as Code, como Terraform, Packer, Ansible, Crossplane, etc.\n*   Experiência em automatizar tarefas rotineiras, como deployments e configuração de monitoramento.\n*   Experiência com gerenciamento de incidentes e estar de plantão para sistemas e workloads produtivos.\n*   Excelentes habilidades de comunicação escrita em inglês, incluindo leitura e redação de documentos.\n*   Experiência com sistemas complexos, em larga escala e de alta disponibilidade.\n*   Experiência com monitoramento e telemetria em aplicações e infraestrutura.\n*   Histórico de liderança técnica e responsabilidade por projetos críticos, incluindo a mentoria de membros juniores da equipe.\n\n**Diferenciais:**\n\n*   Experiência na construção e automação de workloads mobile e sua tecnologia (iOS, Android, Flutter, etc.).\n*   Bônus extra se relacionado a jogos (por exemplo, Unity, Godot).\n\n**Benefícios:**\n\n*   [A empresa deve listar os benefícios aqui. Ex: Plano de saúde, plano odontológico, vale refeição, seguro de vida, etc.]\n\n*Wildlife Studios is an equal opportunity employer and embraces diversity and inclusion.*",
    "applyLink": "https://job-boards.greenhouse.io/wildlifestudios/jobs/8226951002",
    "postedDate": "2025-10-24T00:00:00.000Z",
    "category": "Game Dev",
    "tags": [
      "Design",
      "Go",
      "Git",
      "Python",
      "CI/CD",
      "AWS",
      "Unity",
      "Kubernetes",
      "Node.js",
      "TypeScript"
    ],
    "location": {
      "scope": "remote-worldwide"
    },
    "companyWebsite": "https://wildlifestudios.com/",
    "shortDescription": "**Senior Site Reliability Engineer**\n**Wildlife Studios**\n\n**Sobre a Vaga:**\n\nEstamos buscando um(a) Site Reliability Engineer (SRE) talentoso(a) e apaixonado(a) para se juntar à equipe de Cloud Platform da Wildlife. Como SRE, seu objetivo será fornecer sistemas fáceis de usar e altamente disponí..."
  },
  {
    "id": "WIL-649002",
    "companyName": "Wildlife Studios",
    "companyLogo": "/images/companies/wildlifestudios.svg",
    "jobTitle": "Senior Performance Marketing Analyst - Creatives ",
    "description": "**Analista Sênior de Performance Marketing - Criativos**\n**Wildlife Studios**\n\n**Sobre a Vaga:**\n\nEstamos à procura de um(a) Analista Sênior de Performance Marketing para integrar nossa equipe de Estratégia Criativa. Se você é apaixonado(a) por ideias inovadoras, resultados mensuráveis e inteligência de mercado, esta é a sua oportunidade de moldar o futuro criativo do mobile gaming em grande escala. O(A) profissional será fundamental para impulsionar a visão criativa por trás de nossas campanhas de performance marketing, garantindo que cada decisão seja baseada em dados, insights e um profundo conhecimento da indústria de jogos mobile.\n\n**Responsabilidades:**\n\n*   Co-liderar e impulsionar a estratégia criativa em múltiplos jogos, em colaboração com Product Marketing Managers (PMMs).\n*   Elaborar briefs criativos claros e acionáveis, conectando insights estratégicos à execução.\n*   Liderar o desenvolvimento end-to-end de assets criativos de alta performance (vídeos, playables, estáticos) para campanhas de performance marketing.\n*   Analisar os resultados de performance dos criativos e iterar com base em métricas-chave (Spend Share, IPM, CTR, CPI, ROAS).\n*   Realizar benchmarking contínuo de tendências criativas das indústrias de jogos e mobile ads, traduzindo insights em campanhas inovadoras e eficazes.\n*   Manter-se atualizado(a) sobre tendências de mercado e de gênero, comportamento do jogador e estratégias criativas da concorrência.\n*   Utilizar ou colaborar com ferramentas de creative intelligence para orientar o planejamento e a ideação.\n*   Fazer parceria com PMMs e Data Scientists para definir metodologias de teste e descobrir insights acionáveis.\n*   Atuar como um ponto central de alinhamento para prioridades criativas entre Marketing e Produção.\n*   Elevar o nível criativo, escalando a produção e ajudando a equipe a atingir metas de volume, qualidade e performance.\n*   Apoiar a melhoria contínua das operações criativas por meio de estrutura, processo e liderança.\n\n**Requisitos:**\n\n*   Sólida experiência em performance marketing, com profundo envolvimento na estratégia criativa e execução de campanhas de User Acquisition.\n*   Forte compreensão de KPIs criativos e métricas de performance, e como aplicá-los à iteração e tomada de decisão.\n*   Experiência na condução de creative benchmarking e extração de insights do mercado.\n\n**Diferenciais:**\n\n*   Familiaridade com a indústria de jogos mobile ou experiência em trabalhar com criativos de performance para jogos ou aplicativos.\n*   Familiaridade com motion design e/ou desenvolvimento de playable ads.\n*   Familiaridade com ferramentas de market intelligence.\n\n**Benefícios:**\n\n[A empresa deverá preencher esta seção com os benefícios oferecidos.]",
    "applyLink": "https://job-boards.greenhouse.io/wildlifestudios/jobs/8206649002",
    "postedDate": "2025-10-09T00:00:00.000Z",
    "category": "Game Dev",
    "tags": [
      "Design",
      "Go",
      "Git",
      "Game Dev",
      "Mobile",
      "Senior",
      "AI",
      "Unity",
      "TypeScript"
    ],
    "location": {
      "scope": "hybrid"
    },
    "companyWebsite": "https://wildlifestudios.com/",
    "shortDescription": "**Analista Sênior de Performance Marketing - Criativos**\n**Wildlife Studios**\n\n**Sobre a Vaga:**\n\nEstamos à procura de um(a) Analista Sênior de Performance Marketing para integrar nossa equipe de Estratégia Criativa. Se você é apaixonado(a) por ideias inovadoras, resultados mensuráveis e inteligê..."
  },
  {
    "id": "WIL-895002",
    "companyName": "Wildlife Studios",
    "companyLogo": "/images/companies/wildlifestudios.svg",
    "jobTitle": "Wildlife Studios Internship Program - 2026 ",
    "description": "**Wildlife Studios Internship Program - 2026**\n\n**Empresa:** Wildlife Studios\n\n**Sobre a Vaga:**\n\nA Wildlife Studios, uma das líderes mundiais no desenvolvimento e publicação de jogos mobile, oferece programas de estágio projetados para estudantes que desejam iniciar suas carreiras na indústria de jogos. Como estagiário, você trabalhará ao lado de profissionais experientes, contribuirá para projetos reais e fará parte de uma empresa que cria jogos jogados por milhões de pessoas em todo o mundo. O programa oferece treinamento técnico e de *soft skills*, mentoria e oportunidades de desenvolvimento estruturadas para prepará-lo para o crescimento futuro na carreira.\n\n**Responsabilidades:**\n\n*   Apoiar análises, projetos e iniciativas que impactam diretamente nossos jogos e negócios.\n*   Participar de casos técnicos e de negócios, desafios de resolução de problemas e sessões de *brainstorming* com colegas e líderes.\n*   Participar de sessões de aprendizado estruturadas e mentoria para acelerar seu desenvolvimento.\n*   Trazer novas perspectivas e ideias inovadoras para ajudar a moldar o futuro de nossos produtos.\n\n**Onde Você Pode Trabalhar (Regular Internship):**\n\n*   **Engenharia (Game Tech & Platform Eng):** Trabalhar na manutenção de jogos lançados, com milhões de jogadores diários. Envolver-se em atividades necessárias para manter os aplicativos ativos, bem como implementar novos recursos para aprimorar a experiência do jogador.\n\n*   **Product Management:** Apoiar os *product managers* no planejamento e entrega de novos recursos, executar testes A/B e analisar dados para orientar as decisões de produto. Ajudar a moldar a visão do jogo, alinhar com engenharia, arte, dados e distribuição, e assumir a responsabilidade por suas entregas com autonomia real para impactar a experiência do jogador.\n\n*   **Data Science:** Expandir o potencial do jogo, fornecendo soluções não triviais para questões de negócios, como analisar o desempenho do jogo, envolver os jogadores, personalizar o conteúdo, executar experimentos bem-sucedidos e otimizar a economia do jogo.\n\n*   **Data Engineering:** Projetar, construir e manter os *data pipelines* escaláveis que processam bilhões de eventos de nossa base global de jogadores. Você trabalhará com conjuntos de dados massivos, garantindo a confiabilidade e a qualidade da infraestrutura de dados que capacita as decisões orientadas por dados em toda a empresa, e colaborando estreitamente com cientistas de dados e analistas.\n\n*   **Business & Marketing:** Desenvolver iniciativas de negócios, analisar mercados e criar estratégias criativas para impulsionar o crescimento de nossos jogos. Trabalhar em campanhas publicitárias, colaborações com influenciadores, parcerias e estudos de ROI, combinando criatividade, dados e visão estratégica para expandir o alcance e o impacto de nossos jogos.\n\n*   **Business Analyst:** *User Acquisition* (UA) traz jogadores para nossos mundos e fica mais inteligente a cada dia. Misturamos dados, código e criatividade...\n\n**Requisitos:**\n\n*   (A serem definidos de acordo com a área de interesse)\n\n**Benefícios:**\n\n*   (A serem definidos - exemplos: Bolsa-auxílio, vale-transporte, vale-refeição, seguro de vida, etc.)\n\n**Observação:**\n\nA Wildlife Studios valoriza a diversidade e inclusão. Todos os candidatos qualificados serão considerados para as vagas, independentemente de raça, cor, religião, sexo, orientação sexual, identidade de gênero, nacionalidade, deficiência ou idade.",
    "applyLink": "https://job-boards.greenhouse.io/wildlifestudios/jobs/8169895002",
    "postedDate": "2025-09-16T00:00:00.000Z",
    "category": "Game Dev",
    "tags": [
      "Design",
      "Go",
      "Game Dev",
      "Mobile",
      "AI",
      "Unity",
      "Engine",
      "TypeScript"
    ],
    "location": {
      "scope": "hybrid"
    },
    "companyWebsite": "https://wildlifestudios.com/",
    "shortDescription": "**Wildlife Studios Internship Program - 2026**\n\n**Empresa:** Wildlife Studios\n\n**Sobre a Vaga:**\n\nA Wildlife Studios, uma das líderes mundiais no desenvolvimento e publicação de jogos mobile, oferece programas de estágio projetados para estudantes que desejam iniciar suas carreiras na indústria d...",
    "contractType": "Internship"
  },
  {
    "id": "WIL-562002",
    "companyName": "Wildlife Studios",
    "companyLogo": "/images/companies/wildlifestudios.svg",
    "jobTitle": "Senior Game Engineer",
    "description": "**Título da vaga:** Senior Game Engineer\n\n**Empresa:** Wildlife Studios\n\n**Sobre a vaga:**\n\nEstamos buscando um(a) Game Engineer talentoso(a) e apaixonado(a) para se juntar ao Live Games Tech Team da Wildlife em São Paulo. Como Game Engineer, você trabalhará na manutenção de jogos já lançados, com milhões de jogadores diários. Você estará envolvido(a) em atividades necessárias para manter os aplicativos ativos, bem como na implementação de novos recursos para aprimorar a experiência do jogador. Acreditamos que nosso trabalho tem um grande impacto no sucesso e na cultura da empresa. O(A) candidato(a) ideal é curioso(a) por natureza, se sente confortável em um ambiente de \"tomar a iniciativa\", adora resolver problemas e prospera em um negócio rápido e em crescimento.\n\n**Responsabilidades:**\n\n*   Trabalhar em jogos ativos com milhões de jogadores.\n*   Implementar e testar a lógica de negócios em jogos e serviços.\n*   Realizar manutenção e atualizações para manter o jogo em funcionamento.\n*   Lançar novas versões para produção, supervisionar métricas e feedback dos usuários após o lançamento.\n*   Fornecer transparência oportuna do status do desenvolvimento e dos riscos para as partes interessadas.\n*   Ajudar a resolver os problemas técnicos mais desafiadores do jogo, em parceria com os membros da equipe.\n*   Trabalhar em um ambiente ágil.\n\n**Requisitos:**\n\n*   Experiência no desenvolvimento de aplicativos ou jogos para dispositivos móveis.\n*   Bacharelado em Ciência da Computação, Engenharia da Computação ou combinação equivalente de educação e experiência.\n*   Proficiência em inglês (todos os documentos e algumas reuniões são em inglês).\n\n**Diferenciais:**\n\n*   Ter aplicativos/jogos publicados nas lojas de aplicativos móveis.\n*   Experiência com C++, Objective C, Java para Android, OpenGL, C#, Unity.\n*   Experiência com backend (JavaScript, Node, GoLang e Kubernetes).\n*   Experiência como referência técnica para colegas mais juniores.\n\n**Sobre você:**\n\n*   Você é motivado(a) a trabalhar em jogos que têm milhões de jogadores.\n*   Você se sente confortável em navegar em grandes projetos e investigar o código para entender como as coisas funcionam.\n*   Você gosta de aprender diferentes tecnologias.\n*   Você é proativo(a), entende os objetivos gerais e trabalha para alcançá-los de forma autônoma.\n*   Você consegue se comunicar claramente com sua equipe.\n\n**Benefícios:**\n\nA Wildlife é uma das principais desenvolvedoras e editoras de jogos para dispositivos móveis do mundo. Lançamos mais de 60 títulos, alcançando bilhões de pessoas em todo o mundo. Aqui, criamos e mantemos jogos que irão emocionar, intrigar e envolver nossos jogadores por muitos anos!\n\nA Wildlife se orgulha de ser uma empregadora de oportunidades iguais.",
    "applyLink": "https://job-boards.greenhouse.io/wildlifestudios/jobs/8160562002",
    "postedDate": "2025-09-09T00:00:00.000Z",
    "category": "Game Dev",
    "tags": [
      "Java",
      "Go",
      "C#",
      "C++",
      "JavaScript",
      "AI",
      "Unity",
      "Kubernetes",
      "Node.js",
      "TypeScript"
    ],
    "location": {
      "scope": "hybrid"
    },
    "companyWebsite": "https://wildlifestudios.com/",
    "shortDescription": "**Título da vaga:** Senior Game Engineer\n\n**Empresa:** Wildlife Studios\n\n**Sobre a vaga:**\n\nEstamos buscando um(a) Game Engineer talentoso(a) e apaixonado(a) para se juntar ao Live Games Tech Team da Wildlife em São Paulo. Como Game Engineer, você trabalhará na manutenção de jogos já lançados, co..."
  },
  {
    "id": "WIL-573002",
    "companyName": "Wildlife Studios",
    "companyLogo": "/images/companies/wildlifestudios.svg",
    "jobTitle": "Senior 2D Artist",
    "description": "**Senior 2D Artist**\n**Wildlife Studios**\n\n**Sobre a Vaga**\n\nJunte-se ao crescente Art Team da Wildlife! Nossos jogos alcançam milhões de jogadores, oferecendo personagens inesquecíveis, mundos vibrantes e experiências emocionantes. Somos um time de artistas versáteis, curiosos e apaixonados, trabalhando em sinergia com designers, engenheiros e PMs para criar jogos mobile icônicos. Acreditamos na inovação e na autonomia criativa, buscando continuamente aprimorar nossos processos, inclusive explorando o uso de ferramentas de Gen-AI para iterações mais rápidas e inspiradas.\n\nComo 2D Game Artist, você será um criador adaptável, contribuindo em diversas áreas da arte para dar vida aos jogos. Trabalhará em estreita colaboração com equipes multidisciplinares para transformar ideias em experiências visuais atraentes, desde protótipos iniciais até assets de produção refinados.\n\n**Responsabilidades**\n\n*   **Liderar a visão artística:** Atuar como o principal artista na equipe central do jogo, definindo como a arte se manifestará no jogo. Contará com o apoio de diretores de arte e de todo o departamento de arte.\n*   **Game Artist:** Sua principal habilidade será arte 2D, mas terá oportunidades de trabalhar com outras especialidades artísticas, dependendo do que for melhor para o jogo, desde UI até algum nível de 3D e animação (artista em \"T\").\n*   **Colaboração:** Participar de uma equipe multidisciplinar, focada em criar uma experiência de jogo única. Contribuir para moldar o design do jogo, buscando a diversão. Colaborar com outras áreas da Wildlife, como Marketing, para definir o tema artístico do jogo usando dados reais dos jogadores.\n*   **Resolução de Problemas:** Ajudar a transformar Game Design Documents (GDDs) em jogos mobile jogáveis, e auxiliar na definição de pipelines para as próximas fases de desenvolvimento.\n\n**Requisitos**\n\n*   **Game Developer:** Paixão por criar jogos. Compreensão de como os visuais influenciam o gameplay, UX e o engajamento do jogador. Habilidade para trabalhar colaborativamente, resolver problemas e entregar resultados de alta qualidade.\n*   **Visual Worldbuilder:** Capacidade de pensar em histórias, atmosferas e estéticas. Habilidade em usar imagens para evocar emoção, sugerir lore e comunicar a direção do estilo.\n*   **Hybrid Creator:** Forte conhecimento fundamental de 2D (composição, cor, anatomia, iluminação) e familiaridade com o uso de ferramentas de Gen-AI para esboçar ideias, refinar direções ou construir referências rapidamente.\n*   **AI-Native Explorer:** Não ser apenas um usuário de ferramentas de Gen-AI, mas sim explorá-las ativamente. Compreensão de como controlar a qualidade do modelo, construir prompts personalizados, usar workflows de inpainting e combinar resultados de Gen-AI com técnicas tradicionais (paintover, photobash, etc.).\n*   **Team Player:** Ser um membro de equipe automotivado, que busca proativamente feedback e compartilha conhecimento. Boa interação com pessoas de diferentes origens e especialidades.\n\n**Benefícios**\n\n[A empresa deverá inserir a lista de benefícios oferecidos aqui.]\n\n*Wildlife Studios is an equal opportunity employer and committed to creating an inclusive environment for all employees.*",
    "applyLink": "https://job-boards.greenhouse.io/wildlifestudios/jobs/8160573002",
    "postedDate": "2025-09-09T00:00:00.000Z",
    "category": "Animation",
    "tags": [
      "3D",
      "Design",
      "Go",
      "Animation",
      "Mobile",
      "AI",
      "2D",
      "Unity",
      "Artist",
      "TypeScript"
    ],
    "location": {
      "scope": "hybrid"
    },
    "companyWebsite": "https://wildlifestudios.com/",
    "shortDescription": "**Senior 2D Artist**\n**Wildlife Studios**\n\n**Sobre a Vaga**\n\nJunte-se ao crescente Art Team da Wildlife! Nossos jogos alcançam milhões de jogadores, oferecendo personagens inesquecíveis, mundos vibrantes e experiências emocionantes. Somos um time de artistas versáteis, curiosos e apaixonados, tra..."
  },
  {
    "id": "WIL-785002",
    "companyName": "Wildlife Studios",
    "companyLogo": "/images/companies/wildlifestudios.svg",
    "jobTitle": "Senior Playable Ads Developer",
    "description": "**Senior Playable Ads Developer**\nWildlife Studios\n\n**Sobre a Vaga:**\n\nEstamos à procura de um(a) Game Engineer sênior, talentoso(a) e apaixonado(a) para se juntar à equipe de Marketing Art da Wildlife em São Paulo, Brasil. Como Engenheiro(a) Sênior na equipe de Playables, você será responsável por desenvolver playable ads que atrairão milhões de novos usuários para nossos jogos, além de orientar engenheiros(as) juniores, liderar iniciativas técnicas e impulsionar melhorias em nossos frameworks e processos. Você desempenhará um papel fundamental na definição da estratégia técnica do nosso pipeline de produção de Playables, garantindo que entreguemos anúncios interativos de alto desempenho, escaláveis e criativos em diversas plataformas.\n\n**Responsabilidades:**\n\n*   Desenvolver playable ads de alta qualidade que estabeleçam referências para o setor.\n*   Fornecer atualizações regulares sobre as tarefas em andamento e informar os riscos às partes interessadas.\n*   Propor, projetar e implementar frameworks, ferramentas e sistemas reutilizáveis para melhorar a eficiência e a escalabilidade da produção de Playables.\n*   Fornecer orientação técnica e mentoria a engenheiros(as) juniores e de nível médio, promovendo seu crescimento e garantindo a adesão às melhores práticas.\n*   Conduzir e incentivar revisões de código rigorosas para manter um alto padrão de qualidade do código.\n*   Colaborar estreitamente com Artistas, Diretores(as) Criativos(as), Especialistas em Marketing de Produto e Analistas de Dados para alinhar soluções técnicas com objetivos criativos e de negócios.\n*   Desafiar constantemente o status quo e impulsionar a inovação dentro da equipe de Playables.\n*   Comunicar-se de forma clara, respeitosa e eficaz, promovendo um ambiente de equipe colaborativo e inclusivo.\n\n**Requisitos:**\n\n*   Bacharelado em Ciência da Computação, Engenharia da Computação ou combinação equivalente de educação e experiência.\n*   Forte compreensão dos conceitos de ciência da computação (estruturas de dados, gerenciamento de memória, análise de algoritmos, etc.).\n*   Expertise em JavaScript/TypeScript (web e ecossistema Node.js), HTML, CSS, bem como experiência com PixiJS, ThreeJS e Git.\n*   Conhecimento de shaders e experiência com WebGL/WebGI.\n*   Compreensão dos princípios de game design.\n*   Capacidade de projetar e implementar arquiteturas escaláveis e abstrair soluções técnicas em componentes reutilizáveis.\n*   Experiência na indústria de jogos e desenvolvimento de jogos.\n*   Experiência comprovada na liderança de iniciativas técnicas e colaboração com equipes multifuncionais.\n*   Habilidades em otimização de recursos (gráficos, sons, modelos, etc.).\n*   Experiência em otimizar o desempenho em diferentes dispositivos.\n\n**Benefícios:**\n\n*   [Informações sobre os benefícios oferecidos pela Wildlife Studios]",
    "applyLink": "https://job-boards.greenhouse.io/wildlifestudios/jobs/8127785002",
    "postedDate": "2025-08-19T00:00:00.000Z",
    "category": "Game Dev",
    "tags": [
      "Java",
      "Design",
      "Go",
      "Git",
      "JavaScript",
      "AI",
      "Unity",
      "Node.js",
      "Artist",
      "TypeScript"
    ],
    "location": {
      "scope": "hybrid"
    },
    "companyWebsite": "https://wildlifestudios.com/",
    "shortDescription": "**Senior Playable Ads Developer**\nWildlife Studios\n\n**Sobre a Vaga:**\n\nEstamos à procura de um(a) Game Engineer sênior, talentoso(a) e apaixonado(a) para se juntar à equipe de Marketing Art da Wildlife em São Paulo, Brasil. Como Engenheiro(a) Sênior na equipe de Playables, você será responsável p..."
  },
  {
    "id": "WIL-441002",
    "companyName": "Wildlife Studios",
    "companyLogo": "/images/companies/wildlifestudios.svg",
    "jobTitle": "Senior Game Engineer",
    "description": "**Título da vaga:** Senior Game Engineer\n\n**Empresa:** Wildlife Studios\n\n**Sobre a vaga:**\n\nEstamos buscando um(a) Game Engineer talentoso(a) e apaixonado(a) para se juntar ao Live Games Tech Team da Wildlife em São Paulo. Como Game Engineer, você trabalhará na manutenção de jogos já lançados, com milhões de jogadores diários. Você estará envolvido(a) em atividades necessárias para manter os aplicativos ativos, bem como na implementação de novos recursos para aprimorar a experiência do jogador. Acreditamos que nosso trabalho tem um grande impacto no sucesso e na cultura da empresa. O(A) candidato(a) ideal é curioso(a) por natureza, se sente confortável em um ambiente de \"tomar a iniciativa\", adora resolver problemas e prospera em um negócio rápido e em crescimento.\n\n**Responsabilidades:**\n\n*   Trabalhar em jogos ativos com milhões de jogadores.\n*   Implementar e testar a lógica de negócios em jogos e serviços.\n*   Realizar manutenção e atualizações para manter o jogo em funcionamento.\n*   Lançar novas versões para produção, supervisionar métricas e feedback dos usuários após o lançamento.\n*   Fornecer transparência oportuna do status do desenvolvimento e dos riscos para as partes interessadas.\n*   Ajudar a resolver os problemas técnicos mais desafiadores do jogo, em parceria com os membros da equipe.\n*   Trabalhar em um ambiente ágil.\n\n**Requisitos:**\n\n*   Experiência no desenvolvimento de aplicativos ou jogos para dispositivos móveis.\n*   Bacharelado em Ciência da Computação, Engenharia da Computação ou combinação equivalente de educação e experiência.\n*   Proficiência em inglês (todos os documentos e algumas reuniões são em inglês).\n\n**Diferenciais:**\n\n*   Ter aplicativos/jogos publicados nas lojas de aplicativos móveis.\n*   Experiência com C++, Objective C, Java para Android, OpenGL, C#, Unity.\n*   Experiência com backend (JavaScript, Node, GoLang e Kubernetes).\n*   Experiência como referência técnica para colegas mais juniores.\n\n**Sobre você:**\n\n*   Você é motivado(a) a trabalhar em jogos que têm milhões de jogadores.\n*   Você se sente confortável em navegar em grandes projetos e investigar o código para entender como as coisas funcionam.\n*   Você gosta de aprender diferentes tecnologias.\n*   Você é proativo(a), entende os objetivos gerais e trabalha para alcançá-los de forma autônoma.\n*   Você consegue se comunicar claramente com sua equipe.\n\n**Benefícios:**\n\nA Wildlife é uma das principais desenvolvedoras e editoras de jogos para dispositivos móveis do mundo. Lançamos mais de 60 títulos, alcançando bilhões de pessoas em todo o mundo. Aqui, criamos e mantemos jogos que irão emocionar, intrigar e envolver nossos jogadores por muitos anos!\n\nA Wildlife se orgulha de ser uma empregadora de oportunidades iguais.",
    "applyLink": "https://job-boards.greenhouse.io/wildlifestudios/jobs/8041441002",
    "postedDate": "2025-07-30T00:00:00.000Z",
    "category": "Game Dev",
    "tags": [
      "Java",
      "Go",
      "C#",
      "C++",
      "JavaScript",
      "AI",
      "Unity",
      "Kubernetes",
      "Node.js",
      "TypeScript"
    ],
    "location": {
      "scope": "hybrid"
    },
    "companyWebsite": "https://wildlifestudios.com/",
    "shortDescription": "**Título da vaga:** Senior Game Engineer\n\n**Empresa:** Wildlife Studios\n\n**Sobre a vaga:**\n\nEstamos buscando um(a) Game Engineer talentoso(a) e apaixonado(a) para se juntar ao Live Games Tech Team da Wildlife em São Paulo. Como Game Engineer, você trabalhará na manutenção de jogos já lançados, co..."
  },
  {
    "id": "WIL-475002",
    "companyName": "Wildlife Studios",
    "companyLogo": "/images/companies/wildlifestudios.svg",
    "jobTitle": "Senior Data Scientist",
    "description": "**Senior Data Scientist**\n**Wildlife Studios**\n\n**Sobre a Vaga**\n\nEstamos buscando um(a) Data Scientist talentoso(a) e apaixonado(a) para integrar a equipe de Marketing Tech da Wildlife em São Paulo, Brasil. Na Wildlife, uma das maiores empresas de jogos do mundo, você terá um papel fundamental nas operações de Performance Marketing, trabalhando com dados de milhões de usuários, milhares de campanhas e dezenas de canais diferentes, ajudando-nos a resolver nossos desafios mais complexos. Sua atuação terá um impacto significativo no sucesso e na cultura da empresa. Se você é naturalmente curioso(a), proativo(a), adora resolver problemas, é resiliente e prospera em um ambiente de negócios dinâmico e em crescimento, esta vaga é para você.\n\n**Responsabilidades**\n\n*   Resolver problemas complexos e de escopo aberto que impactam diretamente uma das áreas mais críticas da empresa.\n*   Ajudar a evoluir e aprimorar o desempenho de nossos frameworks de marketing, modelos e produtos de dados atuais.\n*   Participar de uma equipe multifuncional, contribuindo diretamente para nossos processos de ponta a ponta, garantindo que nossos produtos estejam em produção e funcionando corretamente (impacto final).\n*   Trabalhar em um ambiente desafiador e divertido para produzir resultados excepcionais.\n\n**Requisitos**\n\n*   Experiência no design e desenvolvimento de aplicações data-intensive na nuvem com tecnologias como Spark, SQL, Python, Airflow, etc.\n*   Experiência na aplicação de técnicas estatísticas ou de machine learning apropriadas em diferentes situações.\n*   Excelentes habilidades de comunicação de alto nível.\n*   Proficiência em inglês (escrita).\n\n**Desafios Principais**\n\nA equipe é responsável por projetar, construir e evoluir aplicações data-intensive. Como Data Scientist, você nos ajudará a:\n\n*   Extrair insights de grandes e complexos conjuntos de dados que descrevem o comportamento de milhões de jogadores para apoiar a organização de Marketing.\n*   Melhorar continuamente nosso framework de medição de desempenho, que inclui estimar o lifetime value de nossos usuários para entender o retorno a longo prazo de nossos investimentos em Marketing.\n*   Criar e aprimorar as ferramentas para otimizar nossas campanhas de aquisição.\n*   Apoiar a tomada de decisões de nossas operações de Marketing por meio de produtos de dados de alta qualidade e dashboards bem estruturados.\n*   Construir as capacidades para executar experimentos para melhorar continuamente o desempenho de nossos criativos e nossas operações de Marketing.\n\n**Sobre Você**\n\n*   Você é orientado(a) por impacto e tem interesse em aprender mais sobre disciplinas adjacentes.\n*   Você gosta de resolver problemas de escopo aberto com soluções não óbvias.\n*   Você se comunica de forma estruturada, tanto verbalmente quanto por escrito, inclusive em inglês.\n*   Você é um(a) excelente membro de equipe e eleva o nível das pessoas ao seu redor.\n\n**Benefícios**\n\n*   A Wildlife oferece um ambiente de trabalho dinâmico e desafiador, com oportunidades de crescimento e desenvolvimento profissional.\n*   Além do salário competitivo, oferecemos um pacote de benefícios abrangente.\n\n**Sobre a Wildlife**\n\nA Wildlife é uma das principais desenvolvedoras e publishers de jogos mobile do mundo. Lançamos mais de 60 títulos, alcançando bilhões de pessoas em todo o mundo. Aqui, criamos jogos que vão excitar, intrigar e envolver...\n\n*Wildlife Studios é um empregador de oportunidades iguais. Acreditamos na diversidade e inclusão e estamos comprometidos em criar um ambiente de trabalho acolhedor e respeitoso para todos.*",
    "applyLink": "https://job-boards.greenhouse.io/wildlifestudios/jobs/7937475002",
    "postedDate": "2025-05-05T00:00:00.000Z",
    "category": "Game Dev",
    "tags": [
      "Design",
      "Python",
      "Game Dev",
      "Mobile",
      "Senior",
      "AI",
      "Unity",
      "TypeScript"
    ],
    "location": {
      "scope": "hybrid"
    },
    "companyWebsite": "https://wildlifestudios.com/",
    "shortDescription": "**Senior Data Scientist**\n**Wildlife Studios**\n\n**Sobre a Vaga**\n\nEstamos buscando um(a) Data Scientist talentoso(a) e apaixonado(a) para integrar a equipe de Marketing Tech da Wildlife em São Paulo, Brasil. Na Wildlife, uma das maiores empresas de jogos do mundo, você terá um papel fundamental n..."
  },
  {
    "id": "WIL-483002",
    "companyName": "Wildlife Studios",
    "companyLogo": "/images/companies/wildlifestudios.svg",
    "jobTitle": "Senior Data Engineer",
    "description": "**Senior Data Engineer**\n**Wildlife Studios**\nSão Paulo, Brasil\n\n**Sobre a Vaga**\n\nEstamos buscando um(a) Senior Data Engineer talentoso(a) e apaixonado(a) para integrar o time de Marketing Tech da Wildlife em São Paulo. A Wildlife é uma das maiores empresas de jogos do mundo e, além de criar jogos incríveis, um dos seus maiores sucessos é a capacidade de adquirir novos usuários de forma mais eficiente que outras empresas.\n\nComo Senior Data Engineer, você terá um papel fundamental nas nossas operações de Performance Marketing, gerenciando dados de milhões de usuários, milhares de campanhas e dezenas de canais diferentes, ajudando-nos a resolver nossos desafios mais complexos.\n\n**Responsabilidades**\n\n*   Resolver problemas complexos e amplos que impactam diretamente uma das áreas mais críticas da empresa.\n*   Evoluir e melhorar a performance das nossas soluções atuais e construir novos produtos e sistemas de dados.\n*   Participar de um time multifuncional, contribuindo diretamente de ponta a ponta para nossos processos, garantindo que nossos produtos estejam em produção e funcionando corretamente (impacto final).\n*   Trabalhar em um ambiente desafiador e divertido para produzir resultados excepcionais.\n*   Evoluir integrações com diversas APIs de terceiros, incluindo Ad Networks, MMPs e outros provedores de dados.\n*   Atribuir os usuários às campanhas de marketing que impulsionaram seu impacto financeiro.\n*   Estimar o Lifetime Value (LTV) dos nossos usuários para medir o retorno de longo prazo dos nossos investimentos em Marketing.\n*   Construir as capacidades para executar experimentos para melhorar continuamente o desempenho dos nossos criativos e das nossas operações de Marketing.\n*   Apoiar a tomada de decisões das nossas operações de Marketing através de produtos de dados de alta qualidade e dashboards bem estruturados.\n\n**Requisitos**\n\n*   Experiência em projetar e desenvolver aplicações de dados intensivas na nuvem com tecnologias como Spark, SQL, Python, Airflow, etc.\n*   Excelentes habilidades de comunicação de alto nível.\n*   Proficiência em inglês escrito.\n\n**Desafios Principais**\n\nO time é responsável por projetar, construir e evoluir um grande conjunto de aplicações complexas de dados intensivos, incluindo aplicações de dados em batch, ingestão de dados quase em tempo real, modelos de Machine Learning (ML) e pipelines de Business Intelligence (BI).\n\nEssas aplicações também exigem que o time construa, mantenha e evolua integrações com diversas APIs de terceiros, incluindo Ad Networks, MMPs e outros provedores de dados usados em Digital Marketing.\n\nComo Senior Data Engineer, você ajudará o time a garantir alta disponibilidade, confiabilidade, robustez, desempenho, custo-efetividade e manutenibilidade das soluções desenvolvidas.\n\nTemos um ambiente multidisciplinar e você interagirá com pessoas de diversas áreas, incluindo Game Engineers, Backend Engineers, Data Scientists e Product Marketing Managers.\n\n**Benefícios**\n\n*   (A lista de benefícios específicos da Wildlife Studios deve ser adicionada aqui. Ex: Plano de saúde, vale refeição, etc.)\n\n*   Nossa cultura valoriza pessoas com iniciativa, curiosidade, que gostam de resolver problemas, são resilientes e que prosperam em um negócio em rápido crescimento.\n\n*   A Wildlife Studios preza pela diversidade e inclusão. Todas as pessoas qualificadas serão consideradas para as vagas, independentemente de raça, cor, religião, gênero, identidade ou expressão de gênero, orientação sexual, nacionalidade, genética, deficiência ou idade.",
    "applyLink": "https://job-boards.greenhouse.io/wildlifestudios/jobs/7937483002",
    "postedDate": "2025-04-23T00:00:00.000Z",
    "category": "Game Dev",
    "tags": [
      "Design",
      "Git",
      "Python",
      "Game Dev",
      "Mobile",
      "Senior",
      "AI",
      "Unity",
      "Engine",
      "TypeScript"
    ],
    "location": {
      "scope": "hybrid"
    },
    "companyWebsite": "https://wildlifestudios.com/",
    "shortDescription": "**Senior Data Engineer**\n**Wildlife Studios**\nSão Paulo, Brasil\n\n**Sobre a Vaga**\n\nEstamos buscando um(a) Senior Data Engineer talentoso(a) e apaixonado(a) para integrar o time de Marketing Tech da Wildlife em São Paulo. A Wildlife é uma das maiores empresas de jogos do mundo e, além de criar jog..."
  }
]